// Ход коня
// Шахматный конь ходит буквой “Г” — на две клетки по вертикали в любом направлении
// и на одну клетку по горизонтали, или наоборот. Даны две различные клетки шахматной доски, 
// определите, может ли конь попасть с первой клетки на вторую одним ходом.

function horse(a, b, c, d) {
    a1 = a + 2
    b1 = b + 1
    a2 = a + 1
    b2 = b + 2
    a3 = a - 2
    b3 = b - 1
    a4 = a - 1
    b4 = b - 2
    if ((a1 == c) && (b1 == d) || (a2 == c) && (b2 == d) || (a3 == c) && (b3 == d) || (a4 == c) && (b4 == d)) {
        return "yes"
    } else {
        return "no"
    }
}

console.log(horse(2, 4, 3, 2))